<script setup lang="ts">
</script>
<template>
    <el-scrollbar>
        <div class="text-start">
            <p>【小白连接步骤】</p>
            <p>1、开启开发者选项：设置-关于手机-连续点击版本号</p>
            <p>2、打开USB调试：设置-系统和更新-开发者选项-usb调试</p>
            <p>3、数据线将手机连接电脑（必须是支持数据传输的线）</p>
            <p>4、拉下通知栏，将  “仅充电”  改为  “传输文件”（或在开发者选项中开启 “仅充电” 模式下允许ADB调试）</p>
            <p>5、弹出“是否允许USB调试”点击确定（不可或缺）  </p>
            <p>6、不弹授权大概是驱动问题，安装华为（荣耀）手机助手连接</p>

            <p>【常见问题】</p>
            <p>1、本工具使用的是adb接口，不会造成损坏，但您要谨防数据丢失以及未知的意外</p>
            <p>2、性能版块提升游戏帧率带来的副作用：游戏耗电增加，可随时关闭</p>
            <p>3、手机ROM中本就没有的，无法通过工具装回，只能装回原本就有的app</p>
            <p>4、提示“服务启动失败”是因为你把相关服务卸载了，重启后过段时间就不提醒了，如果还提醒就装回相关服务</p>
            <p>5、弹“服务启动失败”据说可以通过先卸载其它，最后再卸载【服务中心】来避免</p>
        </div>
    </el-scrollbar>
</template>